---
kind: property
id: P:Autodesk.Revit.DB.Electrical.ElectricalSystem.IsBasePanelFeedThroughLugsOccupied
source: html/445839cd-f54a-ddb7-438e-23e55f48ec5c.htm
---
# Autodesk.Revit.DB.Electrical.ElectricalSystem.IsBasePanelFeedThroughLugsOccupied Property

Checks if the feed through lugs of the base panel is already occupied.

## Syntax (C#)
```csharp
public bool IsBasePanelFeedThroughLugsOccupied { get; }
```